/**********************************************************************
 *	16bit TIMER1 を使用した割り込みハンドラー.
 **********************************************************************
 *	timer_init()
 *	timer_wait()
 */
#ifndef _timer_h_
#define _timer_h_

#include "task.h"
/**********************************************************************
 *	時計用
 **********************************************************************
 */
typedef struct {
	uchar msec;		// 0..99
	uchar sec;		// 0..59
	uchar minute;	// 0..59
	uchar hour;		// 0..23
	uchar week;		// 0..6  # 6=Sat 0=Sun 
} Time;

extern	Time alarm;
extern	Time cur;


void  timer_init(int cnt);
uchar timer_wait(void);
int   timer_gettime(void);

#endif  //_timer_h_
/**********************************************************************
 *	
 **********************************************************************
 */
